In [7]:
students = {
    1: {'name': 'Tej', 'age': 20},
    2: {'name': 'Abc', 'age': 21}
}

In [ ]:
import sqlite3
new= sqlite3.connect('students.db')  
c=new.cursor()
query=""" select * from student """
output = c.execute(query).fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28)]

In [10]:
query = "INSERT INTO student (name, age) VALUES ('Tejas', 18)"
c.execute(query)
new.commit()

In [11]:
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'Tejas', 18)]

In [13]:
c.execute("delete from student where name='Tejas'  ")
new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28)]

In [14]:
c.execute("Insert into student (name , age) values ('tejas',18)")
new.commit()

c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [15]:
c.execute("Update student set age = 20 where name ='Bob'")
new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [16]:
c.execute("select count(*) from student")
output = c.fetchall()
print(output)

[(12,)]

In [23]:
c.execute("delete from student where age=19")
new.commit()    
c.execute("select* from student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [24]:
c.execute("select * from student where age >= 20")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28)]

In [20]:
c.execute("SELECT * FROM student where name LIKE '_i__'")
output = c.fetchall()
print(output)

[(4, 'Mike', 22)]

In [19]:
import pandas as pd
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
print(df)

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28
11  14    tejas   18

In [18]:
#c.execute("delete from student where name='tejas' ")
#new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [25]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
print(df)

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28
11  14    tejas   18

In [ ]:
stu_dict = [
    {"name": "Ved", "age": 24,},
    {"name": "Rohan", "age": 29},
    {"name": "Nishant", "age": 28},
    ]
query = """INSERT INTO student (name, age)
VALUES (:name, :age);"""
c.executemany(query, stu_dict)
new.commit()

In [26]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
df

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28
11  14    tejas   18

In [ ]:
stu_dict =[
    {"name" : "Manish", "age": 19},
    {"name" : "Rohit", "age": 22},
    {"name" : "Suresh", "age": 21}
]
query = """INSERT INTO students (name, age)
VALUES (:name, :age);"""
c.executemany(query, stu_dict)
new.commit()

In [28]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
df

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28
11  14    tejas   18

In [ ]:
c.execute("DELETE FROM students WHERE name IN ('Roshan', 'Rohit', 'Suresh', 'Manish')")

new.commit()
c.execute("SELECT * FROM students")
output = c.fetchall()

In [ ]:
c.execute("SELECT * FROM students")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
df

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28

In [30]:
# c.execute("UPDATE students SET id = 6 WHERE id = 7")
# c.execute("UPDATE students SET id = 7 WHERE id = 11")
# c.execute("UPDATE students SET id = 8 WHERE id = 12")
# c.execute("UPDATE students SET id = 9 WHERE id = 13")

new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [31]:
# c.execute("insert into students (id,name,age) values (3,'Tej',20)")
# new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Ved', 24), (12, 'Rohan', 29), (13, 'Nishant', 28), (14, 'tejas', 18)]

In [ ]:
c.execute("insert into students (name, age) values ('Ayush', 25)")
new.commit()
c.execute("SELECT * FROM students")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (5, 'Rohit', 24), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (9, 'Manish', 28), (10, 'Ayush', 25)]

In [32]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
df

    id     name  age
0    1    Alice   20
1    2      Bob   20
2    3      Tej   20
3    4     Mike   22
4    6  Nishant   28
5    7      Ved   24
6    8    Rohan   29
7   10    Ayush   25
8   11      Ved   24
9   12    Rohan   29
10  13  Nishant   28
11  14    tejas   18

In [34]:
c.execute("delete from student where id in (11,12,13)")
new.commit()
c.execute("SELECT * FROM student")
output = c.fetchall()
print(output)

[(1, 'Alice', 20), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (14, 'tejas', 18)]

In [35]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id', 'name', 'age'])
df

   id     name  age
0   1    Alice   20
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   6  Nishant   28
5   7      Ved   24
6   8    Rohan   29
7  10    Ayush   25
8  14    tejas   18

In [36]:
new = sqlite3.connect("students_clg.db")   
c = new.cursor()

In [37]:
c.execute("select * from students_data")
output =c.fetchall()
print(output)

[(1, 'MIT'), (2, 'Stanford'), (3, 'Harvard'), (4, 'Yale'), (5, 'Princeton'), (6, 'Columbia'), (7, 'Caltech'), (8, 'UCLA'), (9, 'Berkeley'), (10, 'Cornell'), (11, 'University of Chicago'), (12, 'Johns Hopkins University'), (13, 'Duke University'), (14, 'Northwestern University'), (15, 'University of Michigan')]

In [38]:
c.execute("SELECT * FROM students_data")
output = c.fetchall()
df = pd.DataFrame(output, columns=['id','college_name'])
df

    id              college_name
0    1                       MIT
1    2                  Stanford
2    3                   Harvard
3    4                      Yale
4    5                 Princeton
5    6                  Columbia
6    7                   Caltech
7    8                      UCLA
8    9                  Berkeley
9   10                   Cornell
10  11     University of Chicago
11  12  Johns Hopkins University
12  13           Duke University
13  14   Northwestern University
14  15    University of Michigan

In [39]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(c.fetchall())

[('students_data',)]

In [40]:
new= sqlite3.connect('students.db')  
c=new.cursor()

In [ ]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(c.fetchall())

[('student',)]